# Pandas

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [4]:
df = pd.DataFrame(data)

#### 1. Вывести информацию о датафрейме.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [5]:
df.loc[0:2]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [10]:
df1 = df.loc[:,['animal', 'age']]
df1

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [11]:
df2 = df.loc[[3, 4, 8],['animal', 'age']]
df2

  animal  age
3    dog  NaN
4    dog  5.0
8    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [13]:
df3 = df.loc[df['visits']>3]
df3

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [20]:
df.isnull().sum()
df4 = df[df['age'].isnull()]
df4

  animal  age  visits priority
3    dog  NaN       3      yes
7    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [23]:
df5 = df.loc[(df['animal'] == 'cat') & (df['age'] < 3)]
df5

  animal  age  visits priority
0    cat  2.5       1      yes
5    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [24]:
df6 = df.loc[(df['age']>=2) & (df['age']<=4)]
df6

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
5    cat  2.0       3       no
9    dog  3.0       1       no

9. Измените возраст в строке 'f' на 1,5.

In [33]:
df.at[6, 'age'] = 1.5
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  1.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [34]:
df7 = df['visits'].sum()
df7

19

#### 11. Расчитайте суммарный возраст животных

In [35]:
df8 = df['age'].sum()
df8

24.5

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [45]:
 df.loc[10] = ['cat', 2, 1, 'no']
df
df.drop([10], inplace = True)
df

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no
3    dog  NaN       3      yes
4    dog  5.0       2       no
5    cat  2.0       3       no
6  snake  4.5       1       no
7    cat  NaN       1      yes
8    dog  7.0       2       no
9    dog  3.0       1       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [50]:
df9 = df.groupby(by = 'animal').size()
df9

animal
cat      4
dog      4
snake    2
dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [64]:
df10 = df.sort_values(by=['age', 'visits'])
df10

  animal  age  visits priority
2  snake  0.5       2       no
5    cat  2.0       3       no
0    cat  2.5       1      yes
9    dog  3.0       1       no
1    cat  3.0       3      yes
6  snake  4.5       1       no
4    dog  5.0       2       no
8    dog  7.0       2       no
7    cat  NaN       1      yes
3    dog  NaN       3      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [66]:
df11 = df.replace('yes', "Yes").replace('no', "No")
df11

  animal  age  visits priority
0    cat  2.5       1      Yes
1    cat  3.0       3      Yes
2  snake  0.5       2       No
3    dog  NaN       3      Yes
4    dog  5.0       2       No
5    cat  2.0       3       No
6  snake  4.5       1       No
7    cat  NaN       1      Yes
8    dog  7.0       2       No
9    dog  3.0       1       No

#### 16. В столбце «animal» измените записи «snake» на «python».

In [67]:
df12=df
df12['animal']=df['animal'].replace('snake', 'python')
df12

   animal  age  visits priority
0     cat  2.5       1      yes
1     cat  3.0       3      yes
2  python  0.5       2       no
3     dog  NaN       3      yes
4     dog  5.0       2       no
5     cat  2.0       3       no
6  python  4.5       1       no
7     cat  NaN       1      yes
8     dog  7.0       2       no
9     dog  3.0       1       no

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [73]:
dataf = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
dataf1 = dataf.drop_duplicates(subset='A')
dataf1

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [25]:
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = list('abcdefghij'))
min = df.sum().idxmin()
min

'd'

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [12]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
df['value'].fillna((df['value'].mean()), inplace= True)
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [22]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df['from'] = df.From_To.str.split('_').str.get(0)
df['to'] = df.From_To.str.split('_').str.get(1)
df.drop('From_To', 1, inplace = True)
df['from'] = df['from'].str.lower().str.title()
df['to'] = df['to'].str.lower().str.title()
df

   FlightNumber  RecentDelays              Airline      from         to
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London